# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [0]:
s1 = pd.Series(np.random.randint(1,4,100))
s2 = pd.Series(np.random.randint(1,3,100))
s3 = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [12]:
df = pd.concat([s1,s2,s3], axis=1)
df.head()

   0  1      2
0  3  2  20000
1  3  1  23685
2  1  1  20835
3  2  2  14220
4  2  2  22268

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [27]:
df.rename(columns=({0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}),inplace=True)
df.head()

col  bedrs  bathrs  price_sqr_meter
0        3       2            20000
1        3       1            23685
2        1       1            20835
3        2       2            14220
4        2       2            22268

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [39]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn.head()

<class 'pandas.core.frame.DataFrame'>

   0
0  3
1  3
2  1
3  2
4  2

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [40]:
bigcolumn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 0 to 99
Data columns (total 1 columns):
0    300 non-null int64
dtypes: int64(1)
memory usage: 4.7 KB

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [43]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail()

         0
295  17367
296  22224
297  21964
298  26192
299  27580